Revit 2027 API
Application.NewVertexIndexPairArray Method
Returns an array that can hold VertexIndexPair objects.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexIndexPairArray NewVertexIndexPairArray()
Public Function NewVertexIndexPairArray As VertexIndexPairArray
public:
VertexIndexPairArray^ NewVertexIndexPairArray()
member NewVertexIndexPairArray : unit -> VertexIndexPairArray
Return Value
VertexIndexPairArray
The new VertexIndexPairArray objects.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace